src/stage-1-prototype/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
	</Document>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_СвязиЗаказовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_СвязиЗаказовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗадачаId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/Documents/ЗаказКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Технический прототип T05. Не открывает Б24 и не изменяет заказ.
&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш1_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Блок = Элементы.Добавить("Расш1_БлокЗадачаБ24", Тип("ГруппаФормы"));
	Блок.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Блок.Заголовок = "Задача Битрикс24";
	Блок.ОтображатьЗаголовок = Истина;

	Надпись = Элементы.Добавить("Расш1_СтатусПрототипа", Тип("ДекорацияФормы"), Блок);
	Надпись.Вид = ВидДекорацииФормы.Надпись;
	Надпись.Заголовок = "Технический прототип: хранение связи и открытие Б24 ещё не реализованы.";

КонецПроцедуры

// Диагностическое событие вместо открытия Б24: проверяем штатный момент вызова.
&НаКлиенте
&После("ПослеЗаписи")
Процедура Расш1_ПослеЗаписи(ПараметрыЗаписи)

	РежимЗаписи = Неопределено;
	ЗакрытьПослеЗаписи = Ложь;
	Если Не ПараметрыЗаписи.Свойство("РежимЗаписи", РежимЗаписи)
		Или РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	Если Не ПараметрыЗаписи.Свойство("ПринудительноЗакрытьФорму", ЗакрытьПослеЗаписи)
		Или ЗакрытьПослеЗаписи <> Истина Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Расш1_ЗафиксироватьПроведениеИЗакрытие(Объект.Ссылка);
	Исключение
		// Ошибка прототипа не отменяет успешную штатную запись документа.
		Сообщить("Не удалось записать диагностику прототипа Б24. Заказ проведён.");
	КонецПопытки;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура Расш1_ЗафиксироватьПроведениеИЗакрытие(СсылкаЗаказа)

	Если Не СсылкаЗаказа.Проведен Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Заказ
		|ИЗ РегистрСведений.Расш1_СвязиЗаказовБ24
		|ГДЕ Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ", СсылкаЗаказа);
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("STAGE1_POST_CLOSE",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Документы.ЗаказКлиента, СсылкаЗаказа,
		"Технический прототип: успешное проведение с закрытием без связи. Б24 не вызывается.");

КонецПроцедуры
